# У вас є текстовий файл, який містить інформацію про місячні заробітні плати розробників у вашій компанії. 
# Кожен рядок у файлі містить прізвище розробника та його заробітну плату, які розділені комою без пробілів.
# Ваше завдання - розробити функцію total_salary(path), яка аналізує цей файл і 
# повертає загальну та середню суму заробітної плати всіх розробників.


# Вимоги до завдання:

#     Функція total_salary(path) має приймати один аргумент - шлях до текстового файлу (path).
#     Файл містить дані про заробітні плати розробників, розділені комами. Кожен рядок вказує на одного розробника.
#     Функція повинна аналізувати файл, обчислювати загальну та середню суму заробітної плати.
#     Результатом роботи функції є кортеж із двох чисел: загальної суми зарплат і середньої заробітної плати.



def total_salary(path):
    
    with open(path, 'r', encoding='utf-8') as file:
        line = file.readline()
        count=0
        data_salary=[]
        total=0
        while line != '':
            data_salary = line.strip().split(',')
            count += 1
            total+=float (data_salary[1])
            line = file.readline()
        average= float (total/count)

        return total, average
       


total, average = total_salary("Module_4/monthly_salary.txt")
print(f"Загальна сума заробітної плати: {total}, Середня заробітна плата: {average}")